from arafix import AraFix

corrector = AraFix()

# Correct a single sentence
text = "فِي يَوْمِنَا هَذَا وَاصَرَ الشَّعْبُ الْيَابَانِيُّ إِلٌى يَوْمِنَا هَذَا عَلَى تَقِّلِيدِ الْهَانَامِي، الْآلٍّافُ مِنَ الْأَشْخَاصِ تَمْلَأُ علْحَدَائِقَ لِعَغْدِ حَفْرِ الْهَانَامِي"
corrected_text = corrector.correct(text)
print(f"Corrected Text: {corrected_text}")

reference = "فِي يَوْمِنَا هَذَا وَاصَلَ الشَّعْبُ الْيَابَانِيُّ إِلَى يَوْمِنَا هَذَا عَلَى تَقْلِيدِ الْهَانَامِي، الْآلَافُ مِنَ الْأَشْخَاصِ تَمْلَأُ الْحَدَائِقَ لِعَقْدِ حَفْلِ الْهَانَامِي تَحْتَ الْأَشْجَارِ الْمُزْهَرَةِ"
metrics = corrector.evaluate(reference, corrected_text)
print(f"Cer : {metrics['cer']}")
print(f"Wer : {metrics['wer']}")
print(f"Der : {metrics['der']}")

print("\n", "=" * 50, "\n")

# ==========================================================

# Correct multiple sentences
texts = [
    "غَلَي علْأَرْضِ، تَتُكَوَّنُ الْعُيُومُ نَتِيجَةَ تَّشَبُّعِ الْهَوَاءِ عِنْدَ تَبْرِيدَهِ إِلَى نُقْطَةِ الْنَّضَى",
    "اعْتَنَقَ الْإِسْلَامَ عِنْضَمَا كَانَ مُدَغِّبًا فِي الْمًغْرِبٌّ وَيَتْقَنُ ثَمَانِىَةَ لُغَعطٍ مِنْ بَيْنِهَا ألْعَرَبٌّيَّةُ وَالْفَارِسِيَّةُ",
    "كَمَا نَسْطَخْضِمُهُ بِغَرِّضِ تَأْىِيمِ مُرُّكَّبٍ، مِثْلَمَأ نَعْمَلُ عِندَ إِجْرَاءِ مَطِيَافِيَّةِ الْكُتْلَةِ عَلَي أَخَدِ الْمَوَاضِّ"
]

references = [
    "عَلَى الْأَرْضِ، تَتَكَوَّنُ الْغُيُومُ نَتِيجَةَ تَشَبُّعِ الْهَوَاءِ عِنْدَ تَبْرِيدِهِ إِلَى نُقْطَةِ الْنَّدَى",
    "اعْتَنَقَ الْإِسْلَامَ عِنْدَمَا كَانَ مُدَرِّبًا فِي الْمَغْرِبِ وَيَتْقَنُ ثَمَانِيَةَ لُغَاتٍ مِنْ بَيْنِهَا الْعَرَبِيَّةُ وَالْفَارِسِيَّةُ",
    "كَمَا نَسْتَخْدِمُهُ بِغَرَضِ تَأْيِينِ مُرَكَّبٍ، مِثْلَمَا نَعْمَلُ عِندَ إِجْرَاءِ مَطِيَافِيَّةِ الْكُتْلَةِ عَلَى أَحَدِ الْمَوَادِّ"
]

corrected_texts = corrector.correct(texts)

print(f"Corrected Texts: ")
for i, text in enumerate(corrected_texts):
    print(f"Text {i+1}: {text}")
    print(f"Reference: {references[i]}")
    print("=" * 50, "\n")

metrics = corrector.evaluate(references, corrected_texts)
print(f"Cer : {metrics['cer']}")
print(f"Wer : {metrics['wer']}")
print(f"Der : {metrics['der']}")
